import freqAnalysis as fa
# Gleb Shurin.

def main():
    # Gleb Shurin.
    '''
    שאלה 1:
    סעיף א:
    עברתי על גדלים של מפתח בין 1 ו-26 ורואים שכשאר המפתח הוא
    בגודל של כפולה של 5 מקבלים שהתפלגות האותיות של הצופן מזכירה
    מאוד את התפלגות האותיות בשפה האנגלית רק שהיא טיפה ימינה יותר
     לכן מכאן ניתן היה להסיק שאורך המפתח הוא 5 אם טעינו היינו בודקים ל-10 וכן הלאה.

     לאחר שנקבע שגודל המפתח הוא 5 התכלנו לשנות את אות ההצפנה בהתאמה
     כך שיהיה כמה שיותר התאמות בהתפלגות של האותיות וכך עשינו לכל אות בנפרד
     תוך כדי הסתכלות באיך שהטקסט נראה וכך כל פעם שמצאנו שההזזה התאימה
     הטקסט השתנה לאט לאט לאנגלית ברורה.

     לאחר שסיימנו את תהליך הפענוח קיבלנו שמפתח ההצפנה היה: GRIMM
     והטקסט מדבר על הסיפור של "כיפה אדומה".

     סעיף ב:
     בגלל שויג'ינר עובד בכך שהוא משכפל את המפתח לאורך כל הטקסט אז מפתח כפול
     לא היה משנה את ההצפנה ואת הפענוח כלל.
    '''
    # שאלה 2:
    text = input("Enter your text:")
    count_of_matches = fa.englishFreqMatchScore(text)
    print("The amount of matches in of frequency letters is: ", count_of_matches)


if __name__ == '__main__':
    main()

# Gleb Shurin.
